/**
 * ⚠️ 자동 생성된 파일입니다. 직접 수정하지 마세요.
 * scripts/generate-icon-exports.ts를 다시 실행하여 갱신할 수 있습니다.
 */
import type { SVGProps } from "react";
const IconItemPlus = (props: SVGProps<SVGSVGElement>) => <svg width={24} height={24} viewBox="0 0 24 24" fill="none" xmlns="http://www.w3.org/2000/svg" {...props}><path d="M21.2396 10.8264C21.4973 10.8264 21.7062 11.0353 21.7062 11.293C21.7062 11.5508 21.4973 11.7597 21.2396 11.7597L12.4666 11.7597V20.5326C12.4666 20.7904 12.2577 20.9992 12 20.9992C11.7423 20.9992 11.5334 20.7904 11.5334 20.5326V11.7597L2.76042 11.7597C2.50269 11.7597 2.29381 11.5508 2.29381 11.293C2.29381 11.0353 2.50269 10.8264 2.76042 10.8264L11.5334 10.8264L11.5334 2.05347C11.5334 1.79574 11.7423 1.58686 12 1.58686C12.2577 1.58686 12.4666 1.79574 12.4666 2.05347L12.4666 10.8264L21.2396 10.8264Z" fill="currentColor" /></svg>;
export default IconItemPlus;
