/**
 * ⚠️ 자동 생성된 파일입니다. 직접 수정하지 마세요.
 * scripts/generate-icon-exports.ts를 다시 실행하여 갱신할 수 있습니다.
 */
import type { SVGProps } from "react";
const IconGoodFill = (props: SVGProps<SVGSVGElement>) => <svg width={24} height={24} viewBox="0 0 24 24" fill="none" xmlns="http://www.w3.org/2000/svg" {...props}><path d="M5 9.95211C5 9.39652 5.46313 8.94613 6.03442 8.94613H7.06884C7.64013 8.94613 8.10326 9.39652 8.10326 9.95211V16.994C8.10326 17.5496 7.64013 18 7.06884 18H6.03442C5.46313 18 5 17.5496 5 16.994V9.95211Z" fill="currentColor" /><path d="M9.13768 8.94613H18.9647C19.6851 8.94613 20.1849 9.64447 19.9347 10.3015L18.3527 17.3434C18.2024 17.738 17.8154 18 17.3827 18H10.1721C9.6008 18 9.13768 17.5496 9.13768 16.994V8.94613Z" fill="currentColor" /><path d="M12.2211 4.44806C12.6758 3.78486 13.7051 3.87475 14.031 4.6061L14.1619 4.89997C14.2575 5.11444 14.2732 5.35459 14.2065 5.57914L13.0831 9.36106C12.9105 9.94212 12.2535 10.2448 11.6819 10.0065L9.13768 8.94613L12.2211 4.44806Z" fill="currentColor" /></svg>;
export default IconGoodFill;
